In [6]:
%matplotlib inline
# Dependencies
import matplotlib.pyplot as plt
import numpy as np
import pandas as pd
import os
# Load in csv
file_path = os.path.join('city_data.csv')
file_path

'city_data.csv'

In [7]:
city_data_df = pd.read_csv(file_path)
city_data_df.head(10)

            city  driver_count   type
0    Richardfort            38  Urban
1   Williamsstad            59  Urban
2    Port Angela            67  Urban
3     Rodneyfort            34  Urban
4    West Robert            39  Urban
5   West Anthony            70  Urban
6    West Angela            48  Urban
7  Martinezhaven            25  Urban
8      Karenberg            22  Urban
9    Barajasview            26  Urban

In [8]:
file_path_1 = os.path.join('ride_data.csv')
file_path_1

'ride_data.csv'

In [9]:
ride_data_df = pd.read_csv(file_path_1)
ride_data_df.head(10)

                 city           date   fare       ride_id
0  Lake Jonathanshire  1/14/19 10:14  13.83  5.739410e+12
1  South Michelleport   3/4/19 18:24  30.24  2.343910e+12
2  Port Samanthamouth   2/24/19 4:29  33.44  2.005070e+12
3          Rodneyfort  2/10/19 23:22  23.44  5.149250e+12
4          South Jack    3/6/19 4:28  34.58  3.908450e+12
5        South Latoya  3/11/19 12:26   9.52  1.995000e+12
6       New Paulville  2/27/19 11:17  43.25  7.932080e+11
7        Simpsonburgh   4/26/19 0:43  35.98  1.119540e+11
8     South Karenland    1/8/19 3:28  35.09  7.995620e+12
9       North Jasmine    3/9/19 6:26  42.81  5.327640e+12

In [10]:
# Get the columns and the rows that are not null.
city_data_df.count()

city            120
driver_count    120
type            120
dtype: int64

In [11]:
# Get the columns and the rows that are not null.
city_data_df.isnull().sum()

city            0
driver_count    0
type            0
dtype: int64

In [12]:
# Get the data types of each column.
city_data_df.dtypes

city            object
driver_count     int64
type            object
dtype: object

In [13]:
# Get the unique values of the type of city.
city_data_df["type"].unique()

array(['Urban', 'Suburban', 'Rural'], dtype=object)

In [14]:
# Get the number of data points from the Urban cities.
sum(city_data_df["type"]=="Urban")

66

In [15]:
sum(city_data_df["type"]=="Suburban")

36

In [16]:
sum(city_data_df["type"]=="Rural")

18

In [17]:
# Get the columns and the rows that are not null.
ride_data_df.count()

city       2375
date       2375
fare       2375
ride_id    2375
dtype: int64

In [18]:
# Get the columns and the rows that are not null.
ride_data_df.isnull().sum()

city       0
date       0
fare       0
ride_id    0
dtype: int64

In [19]:
# Get the data types of each column.
ride_data_df.dtypes

city        object
date        object
fare       float64
ride_id    float64
dtype: object

In [20]:
# Combine the data into a single dataset
pyber_data_df = pd.merge(ride_data_df, city_data_df, how="left", on=["city", "city"])

# Display the DataFrame
pyber_data_df.head()

                 city           date   fare       ride_id  driver_count   type
0  Lake Jonathanshire  1/14/19 10:14  13.83  5.739410e+12             5  Urban
1  South Michelleport   3/4/19 18:24  30.24  2.343910e+12            72  Urban
2  Port Samanthamouth   2/24/19 4:29  33.44  2.005070e+12            57  Urban
3          Rodneyfort  2/10/19 23:22  23.44  5.149250e+12            34  Urban
4          South Jack    3/6/19 4:28  34.58  3.908450e+12            46  Urban

In [21]:
# Create the Urban city DataFrame.
urban_cities_df = pyber_data_df[pyber_data_df["type"] == "Urban"]
urban_cities_df.head()

                 city           date   fare       ride_id  driver_count   type
0  Lake Jonathanshire  1/14/19 10:14  13.83  5.739410e+12             5  Urban
1  South Michelleport   3/4/19 18:24  30.24  2.343910e+12            72  Urban
2  Port Samanthamouth   2/24/19 4:29  33.44  2.005070e+12            57  Urban
3          Rodneyfort  2/10/19 23:22  23.44  5.149250e+12            34  Urban
4          South Jack    3/6/19 4:28  34.58  3.908450e+12            46  Urban

In [22]:
# Create the Suburban and Rural city DataFrames.
suburban_cities_df = pyber_data_df[pyber_data_df["type"] == "Suburban"]
rural_cities_df = pyber_data_df[pyber_data_df["type"] == "Rural"]

In [23]:
rural_cities_df.head()

                 city           date   fare       ride_id  driver_count   type
2250   Randallchester  4/13/19 11:13  43.22  1.076080e+12             9  Rural
2251      North Holly   2/2/19 14:54  12.42  1.985260e+12             8  Rural
2252      Michaelberg  3/27/19 18:27  54.85  4.421840e+12             6  Rural
2253  Lake Latoyabury  2/23/19 21:12  47.90  3.269650e+12             2  Rural
2254  Lake Latoyabury    5/6/19 8:57  51.80  4.018030e+12             2  Rural

# Technical Analysis Deliverable 1: A Summary DataFrame

### Total Rides for Each City Type

In [24]:
total_rides_urban_city = urban_cities_df["ride_id"].count()
total_rides_urban_city

1625

In [25]:
total_rides_suburban_city = suburban_cities_df["ride_id"].count()
total_rides_suburban_city

625

In [26]:
total_rides_rural_city = rural_cities_df["ride_id"].count()
total_rides_rural_city

125

### Total Drivers for Each City Type

In [37]:
total_urban_driver = city_data_df.loc[city_data_df["type"]=="Urban", "driver_count"].sum()
total_urban_driver

2405

In [38]:
total_suburban_driver = city_data_df.loc[city_data_df["type"]=="Suburban", "driver_count"].sum()
total_suburban_driver

490

In [39]:
total_rural_driver = city_data_df.loc[city_data_df["type"]=="Rural", "driver_count"].sum()
total_rural_driver

78

### Total Fares for Each City Type

In [40]:
total_urban_fares = pyber_data_df.loc[pyber_data_df["type"]=="Urban", "fare"].sum()
total_urban_fares

39854.380000000005

In [41]:
total_suburban_fares = pyber_data_df.loc[pyber_data_df["type"]=="Suburban", "fare"].sum()
total_suburban_fares

19356.33

In [42]:
total_rural_fares = pyber_data_df.loc[pyber_data_df["type"]=="Rural", "fare"].sum()
total_rural_fares

4327.929999999999

### Average Fare Per Ride

In [43]:
# Calculate the average fare per ride for urban city.
average_fare_per_ride_urban = urban_fares_count / total_rides_urban_city
average_fare_per_ride_urban

24.52577230769231

In [44]:
average_fare_per_ride_suburban = suburban_fares_count / total_rides_suburban_city
average_fare_per_ride_suburban

30.970128000000003

In [45]:
average_fare_per_ride_rural = rural_fares_count / total_rides_rural_city
average_fare_per_ride_rural

34.623439999999995

### Average Fare Per Driver

In [47]:
average_fare_per_driver_urban = urban_fares_count / total_urban_driver
average_fare_per_driver_urban

16.571467775467777

In [48]:
average_fare_per_driver_suburban = suburban_fares_count / total_suburban_driver
average_fare_per_driver_suburban

39.50271428571429

In [49]:
average_fare_per_driver_rural = rural_fares_count / total_rural_driver
average_fare_per_driver_rural

55.486282051282046

### Create the Summary DataFrame

In [ ]:
# Determine the school type.
total_rides_per_school_types = urban_cities_data_df.set_index(["school_name"])["type"]
total_rides_per_school_types

In [80]:
# Adding a list of values with keys to create a new DataFrame.

pyber_summary_df = pd.DataFrame({"Total Rides" : {"Rural" : total_rides_rural_city,
                                        "Suburban" : total_rides_suburban_city,
                                        "Urban" : total_rides_urban_city},
                       "Total Drivers" : {"Rural" : total_rural_driver,
                                         "Suburban" : total_suburban_driver,
                                         "Urban" : total_urban_driver},
                       "Total Fares" : {"Rural" : total_rural_fares,
                                        "Suburban" : total_suburban_fares,
                                        "Urban" : total_urban_fares},
                       "Average Fare per Ride" : {"Rural" : average_fare_per_ride_rural,
                                        "Suburban" : average_fare_per_ride_suburban,
                                        "Urban" : average_fare_per_ride_urban},
                       "Average Fare per Driver" : {"Rural" : average_fare_per_driver_rural,
                                         "Suburban" : average_fare_per_driver_suburban,
                                         "Urban" : average_fare_per_driver_urban}})
pyber_summary_df

,Total Rides,Total Drivers,Total Fares,Average Fare per Ride,Average Fare per Driver
Rural,125,78,4327.93,34.623440,55.486282
Suburban,625,490,19356.33,30.970128,39.502714
Urban,1625,2405,39854.38,24.525772,16.571468

In [81]:
#format the pyber summary dataframe 
pyber_summary_df["Total Rides"] = pyber_summary_df["Total Rides"].map("{:,}".format)
pyber_summary_df["Total Drivers"] = pyber_summary_df["Total Drivers"].map("{:,}".format)
pyber_summary_df["Total Fares"] = pyber_summary_df["Total Fares"].map("${:,.2f}".format)
pyber_summary_df["Average Fare per Ride"] = pyber_summary_df["Average Fare per Ride"].map("${:,.2f}".format)
pyber_summary_df["Average Fare per Driver"] = pyber_summary_df["Average Fare per Driver"].map("${:,.2f}".format)
pyber_summary_df

,Total Rides,Total Drivers,Total Fares,Average Fare per Ride,Average Fare per Driver
Rural,125,78,"$4,327.93",$34.62,$55.49
Suburban,625,490,"$19,356.33",$30.97,$39.50
Urban,"1,625","2,405","$39,854.38",$24.53,$16.57

# Technical Analysis Deliverable 2: Multiple-Line Plot for the Sum of the Fares for Each City Type

In [85]:
# Combine the data into a single dataset
pyber_data_df = pd.merge(ride_data_df, city_data_df, how="left", on=["city", "city"])

# Display the DataFrame
pyber_data_df.head()

                 city           date   fare       ride_id  driver_count   type
0  Lake Jonathanshire  1/14/19 10:14  13.83  5.739410e+12             5  Urban
1  South Michelleport   3/4/19 18:24  30.24  2.343910e+12            72  Urban
2  Port Samanthamouth   2/24/19 4:29  33.44  2.005070e+12            57  Urban
3          Rodneyfort  2/10/19 23:22  23.44  5.149250e+12            34  Urban
4          South Jack    3/6/19 4:28  34.58  3.908450e+12            46  Urban

In [88]:
pyber_data_df.rename(colums = {'city':'City', 'date':'Date','fare':'Fare', 'ride_id': 'Ride Id','driver_count': 'No. Drivers', 'type':'City Type'}, index={0:'Date'})
pyber_data_df.head()

TypeError: rename() got an unexpected keyword argument 'colums'